import pytest


@pytest.fixture
def trans():
    return [
        {
            "Дата операции": "2020-05-26 13:29:09",
            "Дата платежа": "2020-05-28 00:00:00",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -45.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -45.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5499.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 45.0,
        },
        {
            "Дата операции": "2020-05-26 13:23:32",
            "Дата платежа": "2020-05-28 00:00:00",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -86.6,
            "Валюта операции": "RUB",
            "Сумма платежа": -86.6,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 86.6,
        },
    ]
